<?php
/**
 * +----------------------------------------------------------------------
 * | think-auth [thinkphp6]
 * +----------------------------------------------------------------------
 *  .--,       .--,             | FILE: config.php
 * ( (  \.---./  ) )            | AUTHOR: byron
 *  '.__/o   o\__.'             | EMAIL: xiaobo.sun@qq.com
 *     {=  ^  =}                | QQ: 150093589
 *     /       \                | DATETIME: 2019/11/7 15:51
 *    //       \\               |
 *   //|   .   |\\              |
 *   "'\       /'"_.-~^`'-.     |
 *      \  _  /--'         `    |
 *    ___)( )(___               |-----------------------------------------
 *   (((__) (__)))              | 高山仰止,景行行止.虽不能至,心向往之。
 * +----------------------------------------------------------------------
 * | Copyright (c) 2019 http://www.zzstudio.net All rights reserved.
 * +----------------------------------------------------------------------
 */
declare(strict_types=1);

return[
    // 权限设置
    'auth_config'            => [
        'auth_on'           => 1, // 权限开关
	    'auth_type'         => 1, // 认证方式，1为实时认证；2为登录认证。
	    'auth_group'        => 'cj_auth_group', // 用户组数据不带前缀表名
	    'auth_group_access' => 'cj_auth_group_access', // 用户-用户组关系不带前缀表
	    'auth_rule'         => 'cj_auth_rule', // 权限规则不带前缀表
	    'auth_user'         => 'cj_member', // 用户信息不带前缀表
	    'administrator'     =>  [1,2],   // 超级管理员列表
    ],
];

